#### <span style="color:rgb(18, 173, 109);"> Projeto Araguaia</span>

#### <span style="color:rgb(18, 173, 109);"> Storytelling dos Dados</span>

Estes dados são de origem fictícia do banco de dados do Kaggle(plataforma voltada a dados).Desta maneira, possui como finalidade simular os dados do cotidiano da empresa de adubos Araguaia.Sendo os dados presentes, voltados a area de comercial .

#### <span style="color:rgb(18, 173, 109);"> Importação dos Dados</span>

In [1]:
import pandas as pd

In [11]:
df=pd.read_csv("FertilizersProduct.csv", encoding="latin-1")
df.tail()

,Area Code,Area,Item Code,Item,Element Code,Element,Year Code,Year,Unit,Value,Flag
164463,181,Zimbabwe,4006,Urea and ammonium nitrate solutions (UAN),5157,Agricultural Use,2004,2004,tonnes,5.00,Fb
164464,181,Zimbabwe,4006,Urea and ammonium nitrate solutions (UAN),5157,Agricultural Use,2008,2008,tonnes,2.13,Fb
164465,181,Zimbabwe,4006,Urea and ammonium nitrate solutions (UAN),5157,Agricultural Use,2009,2009,tonnes,9.00,Fb
164466,181,Zimbabwe,4006,Urea and ammonium nitrate solutions (UAN),5157,Agricultural Use,2010,2010,tonnes,4971.00,Fb
164467,181,Zimbabwe,4006,Urea and ammonium nitrate solutions (UAN),5157,Agricultural Use,2011,2011,tonnes,7.00,Fb

#### <span style="color:rgb(18, 173, 109);"> Pré visualização dos Dados</span>

In [12]:
df.describe()

,Area Code,Item Code,Element Code,Year Code,Year,Value
count,164468.000000,164468.000000,164468.000000,164468.000000,164468.000000,1.644680e+05
mean,129.207493,4014.222098,5663.300387,2009.734125,2009.734125,9.460314e+04
std,73.530215,9.014672,211.588558,4.542937,4.542937,6.910195e+05
min,1.000000,4001.000000,5157.000000,2002.000000,2002.000000,-1.043000e+03
25%,66.000000,4006.000000,5610.000000,2006.000000,2006.000000,4.553000e+01
50%,126.000000,4014.000000,5622.000000,2010.000000,2010.000000,9.891650e+02
75%,196.000000,4022.000000,5910.000000,2014.000000,2014.000000,1.502811e+04
max,276.000000,4030.000000,5922.000000,2017.000000,2017.000000,4.904667e+07

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 164468 entries, 0 to 164467
Data columns (total 11 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   Area Code     164468 non-null  int64
 1   Area          164468 non-null  object
 2   Item Code     164468 non-null  int64
 3   Item          164468 non-null  object
 4   Element Code  164468 non-null  int64
 5   Element       164468 non-null  object
 6   Year Code     164468 non-null  int64
 7   Year          164468 non-null  int64
 8   Unit          164468 non-null  object
 9   Value         164468 non-null  float64
 10  Flag          164468 non-null  object
dtypes: float64(1), int64(5), object(5)
memory usage: 13.8+ MB

In [14]:
df.columns

Index(['Area Code', 'Area', 'Item Code', 'Item', 'Element Code', 'Element',
       'Year Code', 'Year', 'Unit', 'Value', 'Flag'],
      dtype='object')

In [28]:

dados={"Coluna": ['Area Code', 'Area', 'Item Code', 'Item', 'Element Code', 'Element',
       'Year Code', 'Year', 'Unit', 'Value', 'Flag'],
"valores Únicos":[

df["Area Code"].nunique(),
df["Area"].nunique(),
df["Item Code"].nunique(),
df["Item"].nunique(),
df["Element Code"].nunique(),
df["Element"].nunique(),
df["Year Code"].nunique(),
df["Year"].nunique(),
df["Unit"].nunique(),
df["Value"].nunique(),
df["Flag"].nunique()
]}
#-----------------------------------------------
tabela_valores_unicos = pd.DataFrame(dados)
tabela_valores_unicos

          Coluna  valores Únicos
0      Area Code             171
1           Area             171
2      Item Code              23
3           Item              23
4   Element Code               6
5        Element               6
6      Year Code              16
7           Year              16
8           Unit               2
9          Value          110145
10          Flag               9

In [26]:

dados={"Coluna": ['Area Code', 'Area', 'Item Code', 'Item', 'Element Code', 'Element',
       'Year Code', 'Year', 'Unit', 'Value', 'Flag'],
"valores Nulos":[

df["Area Code"].isnull().sum(),
df["Area"].isnull().sum(),
df["Item Code"].isnull().sum(),
df["Item"].isnull().sum(),
df["Element Code"].isnull().sum(),
df["Element"].isnull().sum(),
df["Year Code"].isnull().sum(),
df["Year"].isnull().sum(),
df["Unit"].isnull().sum(),
df["Value"].isnull().sum(),
df["Flag"].isnull().sum()
]}
#-----------------------------------------------
tabela_valores_nulos = pd.DataFrame(dados)
tabela_valores_nulos

          Coluna  valores Nulos
0      Area Code              0
1           Area              0
2      Item Code              0
3           Item              0
4   Element Code              0
5        Element              0
6      Year Code              0
7           Year              0
8           Unit              0
9          Value              0
10          Flag              0

In [25]:

dados={"Coluna": ['Area Code', 'Area', 'Item Code', 'Item', 'Element Code', 'Element',
       'Year Code', 'Year', 'Unit', 'Value', 'Flag'],
"valores Duplicados":[

df["Area Code"].duplicated().sum(),
df["Area"].duplicated().sum(),
df["Item Code"].duplicated().sum(),
df["Item"].duplicated().sum(),
df["Element Code"].duplicated().sum(),
df["Element"].duplicated().sum(),
df["Year Code"].duplicated().sum(),
df["Year"].duplicated().sum(),
df["Unit"].duplicated().sum(),
df["Value"].duplicated().sum(),
df["Flag"].duplicated().sum()
]}
#-----------------------------------------------
tabela_valores_Duplicados = pd.DataFrame(dados)
tabela_valores_Duplicados

          Coluna  valores Duplicados
0      Area Code              164297
1           Area              164297
2      Item Code              164445
3           Item              164445
4   Element Code              164462
5        Element              164462
6      Year Code              164452
7           Year              164452
8           Unit              164466
9          Value               54323
10          Flag              164459

#### <span style="color:rgb(18, 173, 109);"> Tratamento dos Dados</span>

In [30]:
df.rename(columns={"Area Code":"Cód_pais"},inplace=True)
df.rename(columns={"Area":"País"},inplace=True)
df.rename(columns={"Item Code":"Produto_id"},inplace=True)
df.rename(columns={"Item":"Produto"},inplace=True)
df.rename(columns={"Element Code":"Expecificacao_Cod"},inplace=True)
df.rename(columns={"Element":"Expecificacao"},inplace=True)
df.rename(columns={"Year Code":"Código anual"},inplace=True)
df.rename(columns={"Year":"Ano"},inplace=True)
df.rename(columns={"Unit":"Duração"},inplace=True)
df.rename(columns={"Value":"Valor"},inplace=True)
df.rename(columns={"Flag":"Descrição"},inplace=True)
df.head(2)

,Cód_pais,País,Produto_id,Produto,Expecificacao_Cod,Expecificacao,Código anual,Ano,Duração,Valor,Descrição
0,2,Afghanistan,4007,"Ammonia, anhydrous",5610,Import Quantity,2011,2011,tonnes,4.49,R
1,2,Afghanistan,4007,"Ammonia, anhydrous",5610,Import Quantity,2014,2014,tonnes,2.00,R

#### <span style="color:rgb(18, 173, 109);"> Visualização dos Dados</span>